Repository: AnwarBujangHuat/budgetapp
Catalog: lib/localization/app_*.arb
Languages: ms

# appTitle
source: InBalance
ms: InBalance MY

source: Goals
ms: goals MY

source: Transaction
ms: transaction MY

source: Total
ms: Jumlah

source: Recent Transaction
ms: Transaksi Terkini

source: Retry
ms: Cuba Kembali

source: Import Transaction
ms: Import Transaksi

source: Add New Transaction
ms: Tambah Transaksi

# confirmationAddNewTransaction
source: Do You Want To Add New Transaction?
ms: Anda Pasti Ingin Menambah Transaksi Baharu

source: Add
ms: Tambah

# pleaseSelectTag
source: Please Select a Tag
ms: Sila Pilih Tag

# noTransaction
source: No Transaction Record Found
ms: Tiada Rekod Transaksi

source: Dashboard
ms: dashboard MY

source: Total Net Worth
ms: Total Net Worth MY

source: Total Expenses
ms: Jumlah Belanjawan

source: Total Income
ms: Jumlah Kemasukan

source: Yearly
ms: Tahunan

source: Monthly
ms: Bulanan

source: Weekly
ms: Mingguan

source: Daily
ms: Harian

source: Days Left
ms: Hari Tinggal

# setupGoals
source: Setup Goal
ms: Sediakan Matlamat

# noGoals
source: No Goal Record Found
ms: Tiada Rekod Matlamat Dijumpai

source: Notes
ms: Nota

source: Others
ms: Lain-Lain

source: View More
ms: Lihat Lebih

source: Cancel
ms: Batal

source: Okay
ms: Setuju

# errorDialog
source: Oops, Something went wrong
ms: Oops, Ada masalah

# loadingDialog
source: Hang tight! Processing...
ms: Harap tunggu. Sedang diproses...

# successDialog
source: Success! Your action was completed.
ms: Tindakan berjaya diselesaikan.

# confirmationDialog
source: Confirm?
ms: Pasti?

# successAddTransaction
source: Yay, A New Transaction Has Been Added
ms: Yay, Transaksi Baharu Telah Ditambah

# messageEmptyTag
source: Please Select A Tag for The Transaction
ms: Silih Pilih Tag untuk Membuat Merekod Transaksi

# emptyTag
source: Please Select A Tag
ms: Sila Pilih Tag
